08-rails/solar_system/app/controllers/planets_controller.rb

  def index
    @planets = Planet.all
---
SELECT "planets".* FROM "planets"

  def create
    planet = Planet.create :name => params[:name], :image => params[:image], :orbit => params[:orbit], :diameter => params[:diameter], :mass => params[:mass], :moons => params[:moons]
---
INSERT INTO "planets" ("name", "image", "moons", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Saturn"], ["image", ""], ["moons", 11], ["created_at", "2017-08-22 03:00:43.003266"], ["updated_at", "2017-08-22 03:00:43.003266"]]

  def show
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]

  def destroy
    planet = Planet.find params[:id]
    planet.destroy
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]
DELETE FROM "planets" WHERE "planets"."id" = ?  [["id", 32]]

  def edit
    @planet = Planet.find params[:id]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]

  def update
    planet = Planet.find params[:id]
    planet.update :name => params[:name], :image => params[:image], :orbit => params[:orbit], :diameter => params[:diameter], :mass => params[:mass], :moons => params[:moons]
---
SELECT  "planets".* FROM "planets" WHERE "planets"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
UPDATE "planets" SET "image" = ?, "updated_at" = ? WHERE "planets"."id" = ?  [["image", "https://www.nasa.gov/sites/default/files/moon_and_earth_lroearthrise_frame_0.jpg"], ["updated_at", "2017-08-22 04:37:52.329502"], ["id", 34]]